package com.example.mohamed_nabil.toa;

/**
 * Created by nody on 13/03/2018.
 */
public class items {
    String[] arr = { "أذكار الأستيقاظ من النوم", "دعاء لبس الثوب", "دعاء لبس الثوب الجديد","ما يقول أذا وضع ثوبه","دعاء دخول الخلاء"
            ,"دعاء الخروج من الخلاء","الذكر قبل الوضوء","الذكر بعد الفراغ من الوضوء","الذكر عند الخروج من المنزل","الذكر عند دخول المنزل"
            ,"دعاء الذهاب الى المسجد","دعاء دخول المسجد","دعاء الخروج من المسجد","أذكار الأذان","دعاء الأستفتاح"
            ,"دعاء الركوع","دعاء الرفع من الركوع","دعاء السجود","دعاء الجلسه بين السجدتين","دعاء سجود التلاوة"
            ,"التشهد","الدعاء بعد التشهد الاخير","الأذكار بعد السلام من الصلاه","دعاء صلاة الأستخاره"
            ,"أذكار الصباح","أذكار المساء","أذكار النوم","الدعاء أذا تقلب ليلاً","دعاء الفزع في النوم ومن بلي بالوحشه"
            ,"ما يفعل من رأى الرؤيا أو الحلم","دعاء قنوت الوتر","الذكر عقب السلام من الوتر","دعاء الهم والحزن","دعاء الكرب"
            ,"دعاء لقاء العدو و ذي السلطان","دعاء من خاف ظلم السلطان","الدعاء علي العدو","ما يقول من خاف قوماً","دعاء من أصابه وسوسه في الإيمان"
            ,"دعاء قضاء الدين","دعاء الوسوسه في الصلاه و القراءن","دعاء من استصعب عليه أمر","ما يقول ويفعل من أذنب ذنباً","دعاء طرد الشيطان و وساوسه"
            ,"الدعاء حينما يقع ما لا يرضاه","تهنئة المولود له و جوابه","ما يعوذ به الأولاد","الدعاء للمريض في عيادته","فضل عيادة المريض"
            ,"دعاء المريض الذي يئس من حياته","تلقين المحتضر","دعاء من أصيبه بمصيبه","الدعاء عند إغماض الميت","الدعاء للميت في الصلاه عليه"
            ,"دعاء التعزيه","الدعاء عند أدخال الميت القبر","الدعاء بعد دفن الميت","دعاء زيارة المقابر","دعاء الريح"
            ,"دعاء الرعد","دعاء الأستسقاء","الدعاء إذا رأى المطر","الدعاء بعد نزول المطر","دعاء رؤية الهلال"
            ,"دعاء إفطار الصائم","دعاء قبل الطعام","دعاء بعد الطعام","دعاء الضيف لصاحب الطعام","الدعاء أذا أفطر عند أهل بيت"
            ,"ما يقول الصائم عند دعوته للطعام","ما يقول الصائم اذا سابه أحد","الدعاء عند رؤية باكورة الثمر","دعاء العطاس","الدعاء للمتزوج"
            ,"دعاء المتزوج و شراء الدبله","الدعاء قبل إتيان الزوجه","دعاء الغضب","دعاء من رأى مبتلى","ما يقال في المجلس"
            ,"كفارة المجلس","دعاء من صنع لك معروفاً","ما يعصم الله به الدجال","الدعاء لمن عرض عليك ماله","الدعاء عند قضاء القرض"
            ,"دعاء الخوف من الشرك","دعاء الركوب","دعاء السفر","دعاء دخول القريه او البلد","دعاء دخول السوق"
            ,"الدعاء إذا تعسر المركوب","دعاء المسافر للمقيم","دعاء المقيم للمسافر","الدعاء اذا نزل منزلا","ذكر الرجوع من السفر"
            ,"ذكر من أتاه أمر يسره أو يكرهه","فضل الصلاه على النبي","فضل إفشاء السلام","رد السلام على الكافر","دعاء صياح الديك و نهيق الحمار"
            ,"دعاء نباح الكلب","الدعاء لمن سببته","ما يقول المسلم مادحاً أخيه","تلبية المحرم في الحج و العمره","التكبير عند الحجر الأسود"
            ,"الدعاء بين الركن اليماني و الحجر الأسود","دعاء الوقوف على الصفا و المروه","دعاء يوم عرفة","الذكر عند المشعر الحرام","التكبير عند رمي الجمار"
            ,"دعاء التعجب و الأمر السار","ما يفعل من أتاه أمر يسره","ما يقال عند الوجع","دعاء من خشي أن يصيب شيئ بعينه","الدعاء عند الفزع","دعاء الذبح","دعاء رد كيد مردة الشيطان"
    };
}
